<?php

use App\Models\Mission as Mission;
use App\Services\Radical\RadicalIntegrationManager;
use Illuminate\Database\Seeder;

class MissionTableSeeder extends Seeder {

    private $radical;

    /**
     * Run the database seeds.
     * Use php artisan db:seed to run the seed files.
     *
     * @return void
     */
    public function run() {
        $radical = new RadicalIntegrationManager();

        $radical->registerMission(Mission::create([
                    'name' => 'Cafe/Bar προσβάσιμα σε ΑμεΑ',
                    'description' => 'Ποιους χώρους μπορούν να απολαύσουν οι συμπολίτες μας με κινητικές αναπηρίες; Μοιραστείτε Cafe/Bar που είναι προσβάσιμα από ΑμεΑ. Η Αθήνα είναι όμορφη. Και πρέπει να την χαίρονται όλοι ανεξαιρέτως. Για τους συνανθρώπους μας με κινητικές αναπηρίες πρέπει να κάνουμε πολλά, που δεν γίνονται από τη μια μέρα στην άλλη. Ας αρχίσουμε να δίνουμε λύσεις σήμερα. Για να γίνεται η Αθήνα σιγά - σιγά η πόλη του “μπορώ”.',
                    'type_id' => 1,
                    'radical_service_id' => 'cityrus_cafeBarForDisabled'
        ]));

        $radical->registerMission(Mission::create([
                    'name' => 'Διαδρομές και χώροι αναψυχής προσβάσιμοι από ΑμεΑ',
                    'description' => 'Πού μπορούν να κινηθούν με το αναπηρικό αμαξίδιο οι συμπολίτες μας με κινητικές αναπηρίες; Ποιούς χώρους  αναψυχής μπορούν να επισκεφτούν; Τους ξέρετε; Πόσους από αυτούς επισκεφτήκατε και θέλετε να το μοιραστείτε; Καταγράψτε τις διαδρομές και τα Cafe/Bar που θα επιτρέψουν και σε άλλους να απολαύσουν λίγο περισσότερο αυτούς τους ξεχωριστούς χώρους. Και μην παραλείψετε να ενημερώνεστε για τα νέα προσβάσιμα σημεία που συνεισφέρουν άλλοι χρήστες από το χάρτη.',
                    'type_id' => 2,
                    'radical_service_id' => 'cityrus_routesForDisabled'
        ]));

        $radical->registerMission(Mission::create([
                    'name' => 'Όμορφες διαδρομές για περπάτημα',
                    'description' => 'Ας απολαύσουμε βόλτες στην πόλη! Για ψώνια, για τη φανταστική θέα, για την ιστορία, για ρομαντζάδα, για να ονειρεύεστε... πού σας αρέσει να περπατάτε; Μοιραστείτε το για να μάθουμε και οι υπόλοιποι αυτά τα υπέροχα μέρη! Και μην ξεχάσετε να μάθετε για νέες διαδρομές για περπάτημα που έχουν συνεισφέρει άλλοι χρήστες από το χάρτη. Η Αθήνα είναι μέρος για βόλτα. Ας τη χαρούμε όλοι!',
                    'type_id' => 2,
                    'radical_service_id' => 'cityrus_niceWalkRoutes'
        ]));

        $radical->registerMission(Mission::create([
                    'name' => 'Όμορφες διαδρομές για τρέξιμο',
                    'description' => 'Η κίνηση είναι ζωή! Το τρέξιμο στην πόλη είναι ολοένα για περισσότερους από εμάς ένας υπέροχος τρόπος να ηρεμήσουμε, να αδειάσουμε το μυαλό μας από έγνοιες, να γυμναστούμε, να αποκτήσουμε αντοχή... Τα οφέλη είναι πάμπολλα και δύσκολα περιγράφονται! Καταγράψτε πού σας αρέσει να τρέχετε. Πού απολαμβάνετε το τρέξιμο; Μοιραστείτε το με άλλους! Και μην ξεχάσετε να μάθετε για νέες διαδρομές για τρέξιμο που έχουν συνεισφέρει άλλοι χρήστες από το χάρτη.',
                    'type_id' => 2,
                    'radical_service_id' => 'cityrus_niceRunningRoutes'
        ]));

        $radical->registerMission(Mission::create([
                    'name' => 'Όμορφες διαδρομές για ποδηλασία',
                    'description' => 'Το ποδήλατο είναι ελευθερία! Ποιες διαδρομές είναι ωραίες για ποδηλατοβόλτες; Πού σας αρέσει να πηγαίνετε με το ποδήλατο; Και μην ξεχάσετε να μάθετε για νέες διαδρομές για ποδήλατο που έχουν συνεισφέρει άλλοι χρήστες από το χάρτη.',
                    'type_id' => 2,
                    'radical_service_id' => 'cityrus_niceBicyclingRoutes'
        ]));
    }

}
